brew "eza"
brew "gh"
brew "gnupg"
brew "python@3.13"
brew "starship"
brew "uv"
brew "zsh-autocomplete"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "chatgpt"
cask "contexts"
cask "cursor"
cask "ghostty"
cask "maccy"
cask "spotify"
cask "linear-linear"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "openai.chatgpt"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
